## 10-1 간단한 함수 만들기

#### 제곱함수와 n 제곱함수 만들기

In [1]:
# 제곱함수
def my_sq(x):
    return x ** 2

In [2]:
# n 제곱함수
def my_exp(x, n):
    return x ** n

In [3]:
# 함수 사용
print(my_sq(4))
print(my_exp(2, 4))

16
16

## 10-1 apply 메서드 사용하기 - 기초

#### 시리즈와 데이터프레임에 apply 메서드 사용하기

In [4]:
# 시리즈와 apply 메서드
import pandas as pd
df = pd.DataFrame({'a' : [10, 20, 30], 'b' : [20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
# a열을 제곱
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [7]:
# my_sq apply
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [8]:
# my_exp apply
ex = df['a'].apply(my_exp, n=2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
ex = df['a'].apply(my_exp, n=3)
ex

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [10]:
# 데이터프레임과 apply 메서드
df = pd.DataFrame({'a' : [10, 20, 30], 'b' : [20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [11]:
# 함수 생성
def print_me(x):
    print(x)

In [12]:
# 데이터프레임의 열이나, 행적용
df.apply(print_me, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [13]:
# 3개의 인자를 받아 평균 계산
def avg_3(x, y, z):
    return (x + y + z) / 3

In [14]:
# 열단위를 1개의 인자로 인식하여 오류
df.apply(avg_3)

TypeError: avg_3() missing 2 required positional arguments: 'y' and 'z'

In [15]:
# avg_3 함수가 열 단위로 데이터 인식하게 개선
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

In [17]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

In [22]:
# 보통은 for문으로 만들어서 적용함(몇개인지모르니까)
def avg_apply_col(col):
    sums = 0
    for i in col:
        sums += i
    return sums / df.shape[0]

In [23]:
# 행도 가능
def avg_apply_row(row):
    sums = 0
    for i in row:
        sums += i
    return sums / df.shape[1]

In [24]:
# 적용
df.apply(avg_apply_row, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

## 10-3 apply 메서드 사용하기 - 고급

#### 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용
#### 데이터 프레임의 누락값 처리하기 - 열방향

In [26]:
# 타이타닉 데이터 불러오기
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [27]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [28]:
# 누락값 반환하는 count_missing
import numpy as np
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [30]:
# null값 확인
cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [31]:
# 누락값의 비율 확인
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [32]:
# prop_missing 적용
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [33]:
# 데이터 비율도 가능
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [34]:
pcom_col = titanic.apply(prop_complete)
pcom_col

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [35]:
# 데이터 누락값 처리하기 - 행방향
cmis_row = titanic.apply(count_missing, axis = 1)
cmis_row

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [36]:
pmis_row = titanic.apply(prop_missing,axis = 1)
pmis_row

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [37]:
pcom_row = titanic.apply(prop_complete, axis = 1)
pcom_row

0      0.933333
1      1.000000
2      0.933333
3      1.000000
4      0.933333
         ...
886    0.933333
887    1.000000
888    0.866667
889    1.000000
890    0.933333
Length: 891, dtype: float64

In [38]:
# 누락값의 개수를 구하여 titanic 에 추가
titanic['num_missing'] = titanic.apply(count_missing, axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [40]:
# 누락값이 2개 이상인 데이터만 보기
titanic.loc[titanic.num_missing > 1, :].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
727,1,3,female,NaN,0,0,7.7375,Q,Third,woman,False,NaN,Queenstown,yes,True,2
589,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
367,1,3,female,NaN,0,0,7.2292,C,Third,woman,False,NaN,Cherbourg,yes,True,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2
410,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
547,1,2,male,NaN,0,0,13.8625,C,Second,man,True,NaN,Cherbourg,yes,True,2
568,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
358,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
653,1,3,female,NaN,0,0,7.8292,Q,Third,woman,False,NaN,Queenstown,yes,True,2
415,0,3,female,NaN,0,0,8.0500,S,Third,woman,False,NaN,Southampton,no,True,2